app/Services/PrefixeService.php

    public function getPrefixesParOperateur(): array
    {
        $owner = $this->model
            ->where('id_operateur', 1)
            ->orderBy('prefixe', 'ASC')
            ->findAll();

        $others = $this->model
            ->select('prefixe.*, operateur.libelle AS operateur')
            ->join('operateur', 'operateur.id = prefixe.id_operateur')
            ->where('id_operateur !=', 1)
            ->orderBy('operateur.libelle')
            ->orderBy('prefixe')
            ->findAll();
---
SELECT *
FROM `prefixe`
WHERE `id_operateur` = 1
ORDER BY `prefixe` ASC
SELECT `prefixe`.*, `operateur`.`libelle` AS `operateur`
FROM `prefixe`
JOIN `operateur` ON `operateur`.`id` = `prefixe`.`id_operateur`
WHERE `id_operateur` != 1
ORDER BY `operateur`.`libelle`, `prefixe`