app/Services/TransactionService.php

SELECT SUM(`frais`) AS `total_gains`
FROM `transactions`
 LIMIT 1
---
    public function getTotalGains(): float
    {
        $modelTransaction = new TransactionModel();
        $result = $modelTransaction->selectSum('frais', 'total_gains')->first();

SELECT `operateur`.`libelle` as `operateur`, SUM(transactions.montant_commission) as total_commission
FROM `transactions`
JOIN `operateur` ON `operateur`.`id` = `transactions`.`id_operateur_destinataire`
WHERE `transactions`.`id_type_transaction` = 3
AND `transactions`.`id_operateur_destinataire` != 1
GROUP BY `operateur`.`libelle`
ORDER BY `total_commission` DESC
---
    public function getSituationCommissionParOperateur(): array
    {
        return $this->model->select('operateur.libelle as operateur, SUM(transactions.montant_commission) as total_commission')
            ->join('operateur', 'operateur.id = transactions.id_operateur_destinataire')
            ->where('transactions.id_type_transaction', TypeTransactionModel::TRANSFERT_ID)
            ->where('transactions.id_operateur_destinataire !=', TransactionModel::OPERATEUR_ID) // exclut Yas
            ->groupBy('operateur.libelle')
            ->orderBy('total_commission', 'DESC')
            ->findAll();