app/Services/UtilisateurService.php

SELECT COUNT(*) AS `numrows`
FROM `utilisateur`
WHERE `is_admin` = 0
AND `is_actif` = 1
---
    public function countClientsActifs(): int
    {
        $utilisateurModel = new UtilisateurModel();
        return $utilisateurModel->where('is_admin', 0)
            ->where('is_actif', 1)
            ->countAllResults();