app/Controllers/ClientController.php

    public function dashboard()
    {
        $id = session()->get('idUtilisateur');
        $utilisateurModel = new UtilisateurModel();
        $transactionService = new TransactionService();
        $utilisateur = $utilisateurModel->find($id);
---
SELECT *
FROM `utilisateur`
WHERE `utilisateur`.`id` = 2

    public function solde()
    {
        $utilisateurModel = new UtilisateurModel();

        $id = session()->get('idUtilisateur');

        $utilisateur = $utilisateurModel->find($id);
---
SELECT *
FROM `utilisateur`
WHERE `utilisateur`.`id` = 2

    public function transfert()
    {
        $modelPrefixe = (new PrefixeModel())->select();

        $prefixes = $modelPrefixe
            ->select('prefixe, id_operateur')
            ->get()
            ->getResultArray();


        return view('client/transfert', [
            'baremes' => (new BaremeService())->getBaremesTransfert(),
            'baremesRetrait' => (new BaremeService())->getBaremesRetrait(),
            'prefixes' => $prefixes,
            'commissions' => (new CommissionModel())->findAll(),

            // opérateur connecté
            'idOperateur' => 1
        ]);
---
SELECT *
FROM `commission`

    public function transfertMultiple()
    {
        return view('client/transfert_multiple', [
            'baremes' => (new BaremeService())
                ->getBaremesTransfert(),

            'commissions' => (new \App\Models\CommissionModel())
                ->findAll()
---
SELECT *
FROM `commission`