app/Controllers/OperateurController.php

    public function operateurBaremesCreate(): string
    {
        $data = [
            'typesTransaction' => $this->modelTypeTransaction
                ->orderBy('id', 'asc')
                ->findAll(),
            'baremes' => $this->baremeService->findAllIndexedByTypeTransaction()
        ];
---
SELECT *
FROM `type_transaction`
ORDER BY `id` ASC