app/Models/TransactionModel.php

    public function findHistoriqueByClient(int $clientId): array
    {
        return $this->select('transactions.*, type_transaction.libelle as type_libelle')
            ->join('type_transaction', 'type_transaction.id = transactions.id_type_transaction')
            ->groupStart()
            ->where('transactions.id_client_source', $clientId)
            ->orWhere('transactions.id_client_destinataire', $clientId)
            ->groupEnd()
            ->orderBy('transactions.date_transaction', 'DESC')
            ->findAll();
---
SELECT `transactions`.*, `type_transaction`.`libelle` as `type_libelle`
FROM `transactions`
JOIN `type_transaction` ON `type_transaction`.`id` = `transactions`.`id_type_transaction`
WHERE   (
`transactions`.`id_client_source` = 2
OR `transactions`.`id_client_destinataire` = 2
 )
ORDER BY `transactions`.`date_transaction` DESC

    public function findRecentHistoriqueByClient(int $clientId): array
    {
        return $this->select('transactions.*, type_transaction.libelle as type_libelle')
            ->join('type_transaction', 'type_transaction.id = transactions.id_type_transaction')
            ->groupStart()
            ->where('transactions.id_client_source', $clientId)
            ->orWhere('transactions.id_client_destinataire', $clientId)
            ->groupEnd()
            ->orderBy('transactions.date_transaction', 'DESC')
            ->limit(10)
            ->findAll();
---
SELECT `transactions`.*, `type_transaction`.`libelle` as `type_libelle`
FROM `transactions`
JOIN `type_transaction` ON `type_transaction`.`id` = `transactions`.`id_type_transaction`
WHERE   (
`transactions`.`id_client_source` = 2
OR `transactions`.`id_client_destinataire` = 2
 )
ORDER BY `transactions`.`date_transaction` DESC
 LIMIT 10