app/Models/UtilisateurModel.php

SELECT *
FROM `utilisateur`
WHERE `numero` = '0340000000'
 LIMIT 1
---
    public function findByNumero(string $numero): ?array
    {
        return $this->where('numero', $numero)
            ->first();